###################################################################

# Created by write_sdc on Tue Feb  9 15:07:02 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IM_IN[31]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[30]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[29]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[28]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[27]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[26]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[25]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[24]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[23]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[22]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[21]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[20]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[19]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[18]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[17]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[16]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[15]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[14]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[13]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[12]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[11]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[10]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[9]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[8]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[7]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[6]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[5]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[4]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[3]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[2]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[1]}]
set_load -pin_load 3.40189 [get_ports {IM_IN[0]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[31]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[30]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[29]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[28]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[27]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[26]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[25]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[24]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[23]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[22]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[21]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[20]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[19]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[18]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[17]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[16]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[15]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[14]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[13]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[12]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[11]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[10]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[9]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[8]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[7]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[6]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[5]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[4]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[3]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[2]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[1]}]
set_load -pin_load 3.40189 [get_ports {MEM_IN[0]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[31]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[30]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[29]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[28]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[27]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[26]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[25]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[24]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[23]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[22]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[21]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[20]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[19]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[18]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[17]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[16]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[15]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[14]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[13]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[12]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[11]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[10]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[9]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[8]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[7]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[6]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[5]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[4]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[3]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[2]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[1]}]
set_load -pin_load 3.40189 [get_ports {MEM_ADDR[0]}]
set_load -pin_load 3.40189 [get_ports MEM_EN]
create_clock [get_ports CLK]  -name MY_CLK  -period 0.9  -waveform {0 0.45}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ASYNC_RST_N]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST_N]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IM_OUT[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_OUT[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_IN[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_IN[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_ADDR[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEM_EN]
